zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/syscfg_preview/rtos/CC26X2R1_LAUNCHXL/drivers/spimaster/spimaster.syscfg
/*
 * Copyright (c) 2018, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  spimaster.syscfg
 */

/* ======== Board ======== */
board = system.deviceData.board.name;

/* ======== Display ======== */
var Display = scripting.addModule("/ti/display/Display");
var display = Display.addInstance();
display.$hardware = system.deviceData.board.components.usbUART;

/* ======== GPIO ======== */
var GPIO = scripting.addModule("/ti/drivers/GPIO");

var gpio0 = GPIO.addInstance();
gpio0.$hardware = system.deviceData.board.components.LED0;
gpio0.$name = "Board_GPIO_LED0";

var gpio1 = GPIO.addInstance();
gpio1.$hardware = system.deviceData.board.components.LED1;
gpio1.$name = "Board_GPIO_LED1";

var gpio2 = GPIO.addInstance();
gpio2.$name = "Board_SPI_MASTER_READY";
gpio2.mode = "Dynamic";

var gpio3 = GPIO.addInstance();
gpio3.$name = "Board_SPI_SLAVE_READY";
gpio3.mode = "Dynamic";

/* ======== SPI ======== */
var SPI = scripting.addModule("/ti/drivers/SPI");

var spi0 = SPI.addInstance();
spi0.$name = "Board_SPI_MASTER";

if (board.match(/CC13|CC26/)) {
    if (board.match(/CC1352[P|R]/)) {
        gpio2.$hardware = system.deviceData.board.components.BUTTON0;
    }
    else {
        gpio2.gpioPin.$assign = "DIO15";
    }
    gpio3.gpioPin.$assign = "DIO21";

    spi0.$hardware = system.deviceData.board.components.SPIFlash;
    spi0.defaultTxBufValue = "0xFF";  // Default buffer value
    spi0.spi.clkPin.$assign = "DIO10";
    spi0.spi.somiPin.$assign = "DIO8";
    spi0.spi.simoPin.$assign = "DIO9";
}
else if (board.match(/CC32/)) {
    gpio2.gpioPin.$assign = "P18";
    gpio3.gpioPin.$assign = "P03";

    spi0.mode = "Four Pin, Select active low";
    spi0.tMode = "Disabled";    /* Turbo mode off */
    spi0.spi.dmaTxChannel.$assign = "UDMA_CH7";
    spi0.spi.dmaRxChannel.$assign = "UDMA_CH6";
    spi0.spi.clkPin.$assign = "standard.7"; // P05
    spi0.spi.somiPin.$assign = "standard.14"; // P06
    spi0.spi.simoPin.$assign = "standard.15"; // P07
    spi0.spi.csPin.$assign = "standard.18"; // P08

}
else if (board.match(/MSP.EXP432E/)) {
    gpio2.gpioPin.$assign = "PM3";
    gpio3.gpioPin.$assign = "PL0";

    spi0.mode = "Four Pin, Select active low";
    spi0.defaultTxBufValue = "0xFFFF";
    spi0.spi.$assign = "SSI2";
    spi0.spi.clkPin.$assign = "PD3";
    spi0.spi.somiPin.$assign = "PD0";
    spi0.spi.simoPin.$assign = "PD1";
    spi0.spi.csPin.$assign = "PD2";
    spi0.spi.dmaTxChannel.$assign = "UDMA_CH13";
    spi0.spi.dmaRxChannel.$assign = "UDMA_CH12";
}
else if (board.match(/MSP.EXP432P/)) {
    gpio2.gpioPin.$assign = "P5.7";
    gpio3.gpioPin.$assign = "P6.0";

    spi0.spi.$assign = "EUSCI_A1"; /* Use the peripheral */
    spi0.mode = "Four Pin, Select active low";
    spi0.spi.clkPin.$assign = "P2.5";
    spi0.spi.dmaTxChannel.$assign = "DMA_CH2";
    spi0.spi.dmaRxChannel.$assign = "DMA_CH3";
    spi0.spi.dmaIntNum.$assign = "DMA_INT2";
    spi0.spi.simoPin.$assign = "P2.6";
    spi0.spi.somiPin.$assign = "P2.7";
    spi0.spi.csPin.$assign = "P2.3";
    spi0.defaultTxBufValue = "0xFF"; /* Default TX buffer value */
}
